This module is for MySql Access and Data Engineering on the top

In [12]:
import warnings
warnings.filterwarnings("ignore")

In [22]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\vishva.tripathi\appdata\local\anaconda3\lib\site-packages (1.1.1)Note: you may need to restart the kernel to use updated packages.

In [8]:
pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\vishva.tripathi\appdata\local\anaconda3\lib\site-packages (2.0.25)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\vishva.tripathi\appdata\local\anaconda3\lib\site-packages (from SQLAlchemy) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\vishva.tripathi\appdata\local\anaconda3\lib\site-packages (from SQLAlchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import os
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
%matplotlib inline

pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 100)
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [13]:
# engine = create_engine("mysql+pyodbc://root:root@localhost/world", pool_recycle=3600, echo=True)

In [5]:
pip install mysql.connector

Collecting mysql.connector
  Using cached mysql_connector-2.2.9-cp311-cp311-win_amd64.whl
Installing collected packages: mysql.connector
Successfully installed mysql.connector-2.2.9
Note: you may need to restart the kernel to use updated packages.

In [6]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Using cached mysql_connector_python-9.0.0-cp311-cp311-win_amd64.whl.metadata (2.0 kB)
Using cached mysql_connector_python-9.0.0-cp311-cp311-win_amd64.whl (14.3 MB)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.0.0
Note: you may need to restart the kernel to use updated packages.

In [12]:
import mysql.connector
from mysql.connector import Error

def create_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            password=user_password,
            database=db_name
        )
        print("Connection to MySQL DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

host = "localhost"
user = "root"
password = "root"
database = "sakila"

conn = create_connection(host, user, password, database)

# if conn:
#     conn.close()

Connection to MySQL DB successful

In [13]:
import pandas as pd
SQL_Query_Actor = pd.read_sql_query('''select * FROM sakila.actor''', conn)
SQL_Query_Address = pd.read_sql_query('''select * FROM sakila.address''', conn)
data_Actor = pd.DataFrame(SQL_Query_Actor)
data_Address = pd.DataFrame(SQL_Query_Address)
if conn:
    conn.close()

C:\Users\Vishva.Tripathi\AppData\Local\Temp\ipykernel_41052\3952546915.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  SQL_Query_Actor = pd.read_sql_query('''select * FROM sakila.actor''', conn)
C:\Users\Vishva.Tripathi\AppData\Local\Temp\ipykernel_41052\3952546915.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  SQL_Query_Address = pd.read_sql_query('''select * FROM sakila.address''', conn)

In [14]:
data_Actor.tail(5)

     actor_id first_name last_name         last_update
195       196       BELA    WALKEN 2006-02-15 04:34:33
196       197      REESE      WEST 2006-02-15 04:34:33
197       198       MARY    KEITEL 2006-02-15 04:34:33
198       199      JULIA   FAWCETT 2006-02-15 04:34:33
199       200      THORA    TEMPLE 2006-02-15 04:34:33

In [15]:
data_Address.head(10)
# data finding from top

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\...,2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10...,2014-09-25 22:30:09
2,3,23 Workhaven Lane,None,Alberta,300,,14033335568,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xcd\xc4...,2014-09-25 22:30:27
3,4,1411 Lillydale Drive,None,QLD,576,,6172235589,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00[\r\xe44...,2014-09-25 22:30:09
4,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00(\xd17\x...,2014-09-25 22:31:53
5,6,1121 Loja Avenue,,California,449,17886,838635286649,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00<\x94W\x...,2014-09-25 22:34:01
6,7,692 Joliet Street,,Attika,38,83579,448477190408,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x07oY\x...,2014-09-25 22:31:07
7,8,1566 Inegl Manor,,Mandalay,349,53561,705814003527,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x06$\x0...,2014-09-25 22:32:18
8,9,53 Idfu Parkway,,Nantou,361,42399,10655648674,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x1f\x81...,2014-09-25 22:33:16
9,10,1795 Santiago de Compostela Way,,Texas,295,18743,860452626434,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00PP/\x9d{...,2014-09-25 22:33:55

SQL Server connection

## DM1888\SQLEXPRESS -> DESKTOP-CRBEE2U\MLMI
# AdventureWorks2016  -> MLMI
# 'Trusted_Connection=yes;'

In [3]:
pip install pypyodbc

Collecting pypyodbcNote: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

  Using cached pypyodbc-1.3.6-py3-none-any.whl
Requirement already satisfied: setuptools in c:\users\vishva.tripathi\appdata\local\programs\python\python311\lib\site-packages (from pypyodbc) (65.5.0)
Installing collected packages: pypyodbc
Successfully installed pypyodbc-1.3.6

In [ ]:
# import pyodbc 
import pypyodbc as odbc
conn = odbc.connect('Driver={SQL Server};'
                      'Server=DM1888\SQLEXPRESS;'
                      'Database=AdventureWorks2016;'
                      'Trusted_Connection=yes;')

cursor = conn.cursor()